nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1180/driver_examples/semc/sdram/cm33/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 0.15.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, open_drain: Disable}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, open_drain: Disable}
  - {pin_num: E1, peripheral: SEMC, signal: 'ADDR, 00', pin_signal: GPIO_EMC_B1_09, open_drain: Disable}
  - {pin_num: E3, peripheral: SEMC, signal: 'ADDR, 01', pin_signal: GPIO_EMC_B1_10, open_drain: Disable}
  - {pin_num: F2, peripheral: SEMC, signal: 'ADDR, 02', pin_signal: GPIO_EMC_B1_11, open_drain: Disable}
  - {pin_num: G6, peripheral: SEMC, signal: 'ADDR, 03', pin_signal: GPIO_EMC_B1_12, open_drain: Disable}
  - {pin_num: F3, peripheral: SEMC, signal: 'ADDR, 04', pin_signal: GPIO_EMC_B1_13, open_drain: Disable}
  - {pin_num: G5, peripheral: SEMC, signal: 'ADDR, 05', pin_signal: GPIO_EMC_B1_14, open_drain: Disable}
  - {pin_num: G2, peripheral: SEMC, signal: 'ADDR, 06', pin_signal: GPIO_EMC_B1_15, open_drain: Disable}
  - {pin_num: H1, peripheral: SEMC, signal: 'ADDR, 07', pin_signal: GPIO_EMC_B1_16, open_drain: Disable}
  - {pin_num: E2, peripheral: SEMC, signal: 'ADDR, 08', pin_signal: GPIO_EMC_B1_17, open_drain: Disable}
  - {pin_num: D1, peripheral: SEMC, signal: 'ADDR, 09', pin_signal: GPIO_EMC_B1_18, open_drain: Disable}
  - {pin_num: F1, peripheral: SEMC, signal: 'ADDR, 10', pin_signal: GPIO_EMC_B1_23, open_drain: Disable}
  - {pin_num: F4, peripheral: SEMC, signal: 'ADDR, 11', pin_signal: GPIO_EMC_B1_19, open_drain: Disable}
  - {pin_num: G1, peripheral: SEMC, signal: 'ADDR, 12', pin_signal: GPIO_EMC_B1_20, open_drain: Disable}
  - {pin_num: H3, peripheral: SEMC, signal: 'DATA, 00', pin_signal: GPIO_EMC_B1_00, open_drain: Disable}
  - {pin_num: H4, peripheral: SEMC, signal: 'DATA, 01', pin_signal: GPIO_EMC_B1_01, open_drain: Disable}
  - {pin_num: K2, peripheral: SEMC, signal: 'DATA, 02', pin_signal: GPIO_EMC_B1_02, open_drain: Disable}
  - {pin_num: G3, peripheral: SEMC, signal: 'DATA, 03', pin_signal: GPIO_EMC_B1_03, open_drain: Disable}
  - {pin_num: J4, peripheral: SEMC, signal: 'DATA, 04', pin_signal: GPIO_EMC_B1_04, open_drain: Disable}
  - {pin_num: H6, peripheral: SEMC, signal: 'DATA, 05', pin_signal: GPIO_EMC_B1_05, open_drain: Disable}
  - {pin_num: K3, peripheral: SEMC, signal: 'DATA, 06', pin_signal: GPIO_EMC_B1_06, open_drain: Disable}
  - {pin_num: M3, peripheral: SEMC, signal: 'DATA, 07', pin_signal: GPIO_EMC_B1_07, open_drain: Disable}
  - {pin_num: H2, peripheral: SEMC, signal: 'DATA, 08', pin_signal: GPIO_EMC_B1_30, open_drain: Disable}
  - {pin_num: J2, peripheral: SEMC, signal: 'DATA, 09', pin_signal: GPIO_EMC_B1_31, open_drain: Disable}
  - {pin_num: J1, peripheral: SEMC, signal: 'DATA, 10', pin_signal: GPIO_EMC_B1_32, open_drain: Disable}
  - {pin_num: K1, peripheral: SEMC, signal: 'DATA, 11', pin_signal: GPIO_EMC_B1_33, open_drain: Disable}
  - {pin_num: L2, peripheral: SEMC, signal: 'DATA, 12', pin_signal: GPIO_EMC_B1_34, open_drain: Disable}
  - {pin_num: L1, peripheral: SEMC, signal: 'DATA, 13', pin_signal: GPIO_EMC_B1_35, open_drain: Disable}
  - {pin_num: M1, peripheral: SEMC, signal: 'DATA, 14', pin_signal: GPIO_EMC_B1_36, open_drain: Disable}
  - {pin_num: N1, peripheral: SEMC, signal: 'DATA, 15', pin_signal: GPIO_EMC_B1_37, open_drain: Disable}
  - {pin_num: H5, peripheral: SEMC, signal: 'DM, 0', pin_signal: GPIO_EMC_B1_08, open_drain: Disable}
  - {pin_num: M2, peripheral: SEMC, signal: 'DM, 1', pin_signal: GPIO_EMC_B1_38, open_drain: Disable}
  - {pin_num: P1, peripheral: SEMC, signal: semc_dqs, pin_signal: GPIO_EMC_B1_39, software_input_on: Enable, pull_down_pull_up_config: Pull_Down, open_drain: Disable}
  - {pin_num: N3, peripheral: SEMC, signal: semc_ras, pin_signal: GPIO_EMC_B1_25, open_drain: Disable}
  - {pin_num: F5, peripheral: SEMC, signal: semc_we, pin_signal: GPIO_EMC_B1_28, pull_down_pull_up_config: Pull_Down, open_drain: Disable}
  - {pin_num: K4, peripheral: SEMC, signal: 'BA, 0', pin_signal: GPIO_EMC_B1_21, open_drain: Disable}
  - {pin_num: L3, peripheral: SEMC, signal: 'BA, 1', pin_signal: GPIO_EMC_B1_22, open_drain: Disable}
  - {pin_num: P2, peripheral: SEMC, signal: semc_cas, pin_signal: GPIO_EMC_B1_24, open_drain: Disable}
  - {pin_num: J3, peripheral: SEMC, signal: semc_cke, pin_signal: GPIO_EMC_B1_27, open_drain: Disable}
  - {pin_num: N4, peripheral: SEMC, signal: semc_clk, pin_signal: GPIO_EMC_B1_26, pull_down_pull_up_config: Pull_Down, open_drain: Disable}
  - {pin_num: E4, peripheral: SEMC, signal: 'CS, 0', pin_signal: GPIO_EMC_B1_29, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

